[
  {
    "item": "RFP Due Date and Time",
    "details": "Wednesday, March 12, 2025 no later than 3:30 pm (Local Time)"
  },
  {
    "item": "Project Goal",
    "details": "Centralize and update a user-friendly, visually appealing, and mobile-responsive website."
  },
  {
    "item": "Website Details",
    "details": "Current website: https://www.srmt-nsn.gov/about"
  },
  {
    "item": "Scope of Work",
    "details": "Proposals should describe how each of the project deliverables will be provided."
  },
  {
    "item": "Training Requirement",
    "details": "Provide training for Tribal program staff to maintain websites without specialized technical knowledge or assistance."
  },
  {
    "item": "Written Reports",
    "details": "Provide written reports of completed deliverables on a regular basis to SRMT."
  },
  {
    "item": "Documentation",
    "details": "Provide documentation of new web-based, digital features, and modules – both technical and instructional."
  },
  {
    "item": "Responsiveness",
    "details": "Respond to inquiries and follow-up to action items in a timely manner."
  },
  {
    "item": "Availability",
    "details": "Be available with reasonable notice to meet the SRMT representatives."
  },
  {
    "item": "Post-Launch Website Maintenance and Improvement Plan",
    "details": "Provide a fully transparent and detailed post-launch website maintenance and improvement plan."
  },
  {
    "item": "Term of Contract",
    "details": "Services terminate 1-year from execution of contract."
  },
  {
    "item": "Tax Exemption",
    "details": "SRMT is a tax-exempt organization. Exemption Organization Certification # EX 152433 certifies tax exemption."
  },
  {
    "item": "Insurance Coverage - Comprehensive General Liability",
    "details": "Provide Comprehensive General Liability coverage, minimum $1,000,000.00 general aggregate and the same amount for each occurrence, naming the Saint Regis Mohawk Tribe as additional insured, and submit a copy of certificate upon request."
  },
  {
    "item": "Insurance Coverage - Business Automobile Liability",
    "details": "Provide Business Automobile Liability coverage, minimum $1,000,000.00 combined single limit or $1,000,000.00 bodily injury and $500,000.00 property damage, when contractor uses any vehicle, owned or non-owned in performing contractual duties and submit a copy of certificate upon request."
  },
  {
    "item": "Insurance Underwriter Requirements",
    "details": "All insurances are to be underwritten by a company satisfactory to the SRMT (Best “A” rating) and authorized to do business in the state of New York."
  },
  {
    "item": "Submission Address (Physical)",
    "details": "Saint Regis Mohawk Tribe, Grants & Contracts Office, 71 Margaret Terrance Memorial Way, Akwesasne, NY 13655"
  },
  {
    "item": "Submission Address (Email)",
    "details": "grants.contracts@srmt-nsn.gov"
  },
  {
    "item": "Envelope/Subject Line Labeling",
    "details": "\"RFP No.25-0037 Website Development and Maintenance, Akwesasne, New York\""
  },
  {
    "item": "Submission Method Restrictions",
    "details": "No oral or telephone submissions accepted."
  },
  {
    "item": "Proposal Due Date",
    "details": "Wednesday, March 12, 2025"
  },
  {
    "item": "Proposal Due Time",
    "details": "3:30 p.m. (local time)"
  },
  {
    "item": "Late Submissions",
    "details": "Proposals received after the closing time will not be considered."
  },
  {
    "item": "Inquiry Submission Deadline",
    "details": "Five (5) calendar days prior to the closing due date and time"
  },
  {
    "item": "Inquiry Submission Method",
    "details": "In writing, via mail or email to Grants & Contracts Office"
  },
  {
    "item": "Inquiry Contact",
    "details": "Grants & Contracts Office (grants.contracts@srmt-nsn.gov)"
  },
  {
    "item": "Proposal Format Compliance",
    "details": "All proposals must be in the format required in this RFP; failure to comply may be reason to declare the proposals non-responsive."
  },
  {
    "item": "Amendment Submission Method",
    "details": "Amendments must be in writing and delivered, hand delivered, e-mailed, or mailed to the Grants & Contracts Office."
  },
  {
    "item": "Amendment Signature",
    "details": "Amendments should be signed by the authorized signatory of the Proposer."
  },
  {
    "item": "Amendment Submission Deadline",
    "details": "Amendment must be delivered to the closing location before the closing time, but not after."
  },
  {
    "item": "Acceptance of Terms and Conditions",
    "details": "Submission of a proposal constitutes acceptance of all RFP terms and conditions, unless otherwise specified in the proposal."
  },
  {
    "item": "Proposal Withdrawal",
    "details": "Proposals may be withdrawn prior to the opening time via written request to the Grants & Contracts Office."
  },
  {
    "item": "Proposal Validity Period",
    "details": "The proposal is valid for 60 calendar days following the closing date and time."
  },
  {
    "item": "Responsiveness",
    "details": "Proposal must respond to all requirements of the RFP to be considered responsive."
  },
  {
    "item": "Transmittal Letter - Proposer Information",
    "details": "Include name, contact information (email, phone, mailing address) of proposer/firm and authorized representative with their title(s) and contact information."
  },
  {
    "item": "Transmittal Letter - Statement of Interest",
    "details": "Include a general statement of interest and what sets the proposer apart."
  },
  {
    "item": "Transmittal Letter - Preferences",
    "details": "Include a general statement of any applicable preferences."
  },
  {
    "item": "Transmittal Letter - Signature",
    "details": "Transmittal letter must be signed by an individual authorized to contractually bind the proponent. Unsigned letters may result in rejection."
  },
  {
    "item": "Executive Summary - Approach",
    "details": "Briefly describe proposer’s approach to Web Development and Maintenance Services and its summarized approach to completing the scope of services outlined."
  },
  {
    "item": "Executive Summary - Potential Problems",
    "details": "Summarize any potential problems and provide creative suggestions for addressing them."
  },
  {
    "item": "Executive Summary - Options/Alternatives",
    "details": "Identify any options or alternatives being proposed and clearly disclose any major requirements."
  },
  {
    "item": "Experience and Qualifications Section",
    "details": "Must contain a brief summary of experience in the field and overall qualifications."
  },
  {
    "item": "Key Personnel List",
    "details": "Provide a list of key personnel assigned to the project and their roles."
  },
  {
    "item": "Key Personnel Biographies",
    "details": "Include biographies for all key personnel assigned to the project."
  },
  {
    "item": "Work Samples",
    "details": "Provide three (3) samples of work performed similar in size and scope, as website links or similar."
  },
  {
    "item": "Business References",
    "details": "Provide a minimum of three (3) business references with complete contact information."
  },
  {
    "item": "Fee Proposal",
    "details": "Include a firm fixed pricing structure covering labor, hosting/maintenance, and license renewals."
  },
  {
    "item": "Cost Breakdown",
    "details": "Fee proposal should identify all expected costs and specify services generating additional charges."
  },
  {
    "item": "Alternative Fee Proposals",
    "details": "Respondents can submit alternative fee proposals for consideration."
  },
  {
    "item": "Native / Mohawk Preference",
    "details": "If eligible, provide proof of enrollment/membership in a federally recognized Tribe or proof of certification as an Indian-owned business (Native American Ownership must be 51% or more)."
  },
  {
    "item": "Native American Preference Documentation (Attachment A)",
    "details": "If claiming Native American preference, provide proof of certification per Attachment A."
  },
  {
    "item": "Mohawk Owned Business Certification",
    "details": "If certified with SRMT as Mohawk Owned Business, no documentation explicitly stated but likely required."
  },
  {
    "item": "WBE/DVBE Certification",
    "details": "If eligible for WBE/DVBE preference, provide proof of certification (business registration and government agency certification)."
  },
  {
    "item": "MBE/VBE Certification",
    "details": "If eligible for MBE/VBE preference, provide proof of certification (business registration and government agency certification)."
  },
  {
    "item": "Strategy, Approach and Methodology (Comprehension)",
    "details": "Provide details on Strategy, Approach and Methodology. (30 points)"
  },
  {
    "item": "Fee Proposal and Schedule",
    "details": "Provide a detailed fee proposal and schedule. (25 points)"
  },
  {
    "item": "Firm Experience & Qualifications/Personnel Qualifications",
    "details": "Provide details on the firm's experience and qualifications as well as those of personnel. (35 points)"
  },
  {
    "item": "SRMT Combined Certifications (Attachment B)",
    "details": "Complete, sign, and return SRMT Combined Certifications for Lobbying; Certification Regarding Debarment; Certification Regarding Drug-Free Workplace; Certification Regarding Trafficking in Persons and Anti-Collusion Statement (See Attachment “B”)."
  },
  {
    "item": "SRMT Respiratory Virus Workplace Safety Standards",
    "details": "Proposer agrees to comply with and return signed certifications related to SRMT Respiratory Virus Workplace Safety Standards"
  },
  {
    "item": "Amendment Reference",
    "details": "Refer to Attachment \"C\" and any addenda."
  },
  {
    "item": "Addenda Review",
    "details": "Proposers are responsible for reviewing all addenda to the RFP."
  },
  {
    "item": "Proposal Compliance",
    "details": "Proposals will be evaluated for compliance with minimum qualifications, content, and format requirements of the RFP."
  },
  {
    "item": "Evaluation Criteria",
    "details": "The evaluation process aims to identify proposers with the highest probability of satisfactorily performing the services."
  },
  {
    "item": "Interviews",
    "details": "Interviews may be scheduled with selected Proposers."
  },
  {
    "item": "Non-Responsive Proposals",
    "details": "Non-responsive proposals may be rejected."
  },
  {
    "item": "Proposal Signature",
    "details": "Proposal must be signed."
  },
  {
    "item": "Addenda Acknowledgment",
    "details": "All addenda (if issued) must be acknowledged."
  },
  {
    "item": "Required Submittals/Documentation",
    "details": "All required submittals and documentation must be provided."
  },
  {
    "item": "Submission Deadline",
    "details": "Proposal must be submitted on time."
  },
  {
    "item": "Minimum Requirements",
    "details": "Proposer must meet the minimum requirements."
  },
  {
    "item": "Proprietary Information",
    "details": "Any portion of the proposal marked \"proprietary\" and highlighted can be returned after award of contract, if requested."
  },
  {
    "item": "Confidential Information Marking",
    "details": "Clearly mark any portions of the proposal considered exempt from disclosure as \"Confidential\"."
  },
  {
    "item": "Protest Submission Method",
    "details": "Protest must be in writing and sent by certified or registered mail or delivered personally to SRMT Grants & Contracts Office, 71 Margaret Terrance Memorial Way, Akwesasne, NY 13655. Request a receipt if hand-delivered."
  },
  {
    "item": "Protest Content Requirements",
    "details": "Protest must include the name, address, telephone and e-mail of the party protesting or their representative, the title of the RFP, a detailed description of the specific legal and factual grounds of protest, supporting documentation, and the specific ruling or relief requested."
  },
  {
    "item": "Completeness of Initial Protest Submission",
    "details": "The initial protest submittal must include all grounds for the protest and all evidence available at the time of submission. SRMT will not consider new grounds or evidence raised later that could have been included initially."
  },
  {
    "item": "Eligibility to Protest After Award",
    "details": "To protest the award, the proposer must have submitted a proposal believed to be responsive to the solicitation document and meeting the administrative and technical requirements."
  },
  {
    "item": "Protest Submission Deadline",
    "details": "Protests must be received no later than five (5) business days after receipt of unsuccessful proposer notification."
  },
  {
    "item": "SRMT Corporate Compliance Policy",
    "details": "Proposers must comply with the SRMT Corporate Compliance Policy."
  },
  {
    "item": "Exclusion Database Screening",
    "details": "Successful proposers will be screened against the Department of Health & Human Services/Office of Inspector General and The System for Award Management (SAM) exclusion database."
  },
  {
    "item": "Truthfulness of Certifications",
    "details": "Proposals may be deemed non-responsive if information is missing, inaccurate, or certifications are untrue."
  },
  {
    "item": "Maintaining Up-to-Date Information",
    "details": "The Proposer/bidder will be required to diligently maintain up-to-date the information requested."
  },
  {
    "item": "List of Directors (Incorporated Proposers)",
    "details": "Incorporated proposers/bidders must provide a complete list of names of all individuals who are currently directors of the company/firm with their proposal/bid or promptly thereafter."
  },
  {
    "item": "Name of Owner (Sole Proprietorships)",
    "details": "Proposers/bidders submitting as sole proprietorship must provide the name of the owner with their proposal or promptly thereafter."
  },
  {
    "item": "Consequences of Non-Compliance",
    "details": "Failure to provide the required names within the specified timeframe after notification will render the proposal/bid non-responsive."
  },
  {
    "item": "Mandatory Requirement for Contract Award",
    "details": "Providing the required names is a mandatory requirement for contract award."
  },
  {
    "item": "General Contract Terms and Conditions",
    "details": "The SRMT General Contract Terms and Conditions for Service apply. (See Attachment “D”)"
  },
  {
    "item": "Native American Preference Policy",
    "details": "Refer to Native American Preference Policy Version 003, Page 1 of 12."
  },
  {
    "item": "American Preference Policy Version",
    "details": "Policy Version 003"
  },
  {
    "item": "Mohawk Business Ownership Requirement",
    "details": "Business must be mainly owned (at least 51% or more) by a Mohawk."
  },
  {
    "item": "Mohawk Business Management Requirement",
    "details": "Mohawk owner must be substantially involved in day-to-day management and operations."
  },
  {
    "item": "Mohawk Business Registration and Certification",
    "details": "Business must be registered and received the SRMT Native American Preference Certification through the SRMT Compliance Department."
  },
  {
    "item": "Native American Owned Business (NAOB) Ownership Requirement",
    "details": "Company that is at least 51% owned and operated (e.g. management decisions) by a Native American."
  },
  {
    "item": "NAOB Registration and Certification",
    "details": "Registered and received a SRMT Native American Preference Certification through the SRMT Compliance Department."
  },
  {
    "item": "Page Number",
    "details": "Page 2 of 12"
  },
  {
    "item": "American Preference Employment Plan",
    "details": "Construction Contractors and sub-contractors must submit an employment plan for proposals and adhere to it when contracting with the Tribe."
  },
  {
    "item": "Qualified business or company requirements",
    "details": "Must meet minimum requirements for a contract, including proper insurance coverage (liability, workers' compensation, etc.) and all other requirements in the Invitation for Bids/Request for Quotes. Must also meet practical, technical, administrative, and financial requirements to perform the services or provide the goods."
  },
  {
    "item": "Responsible bidder definition",
    "details": "Contractor/supplier/vendor must have adequate financial resources, comply with legal/regulatory requirements, deliver according to schedule, have a history of satisfactory performance, a good reputation, necessary data/equipment/facilities, and be otherwise eligible and qualified."
  },
  {
    "item": "SRMT Native American Preference Certification",
    "details": "Native Vendor must provide the certification provided by the SRMT Compliance Department where the Native Vendor meets the Native American Owned Business or Company or Mohawk Business definition."
  },
  {
    "item": "Native American Preference",
    "details": "Native American Preference shall be applied to all acquisitions for goods and services for the Saint Regis Mohawk Tribe."
  },
  {
    "item": "Mohawk Owned Business Preference",
    "details": "Businesses that are registered/certified as Mohawk Owned Businesses will be granted an extra 2% or 2 points in the evaluation for goods and services."
  },
  {
    "item": "Qualification Requirement",
    "details": "The Native American Preference must be applied after all bidders or proposers are deemed qualified."
  },
  {
    "item": "Solicitation of Quotes",
    "details": "The Tribe shall solicit construction contracts in accordance with the Tribe’s Procurement Policy."
  },
  {
    "item": "Tribal entities' policies",
    "details": "Tribal entities shall adhere to their respective procurement of goods, services, and construction contract policies while incorporating the Native Preference Policy."
  },
  {
    "item": "Native American Preference Policy",
    "details": "Preference given to Native American bidders according to a sliding scale based on bid amount."
  },
  {
    "item": "Mohawk Preference Example",
    "details": "Additional preference may be given to Mohawk bidders."
  },
  {
    "item": "Sliding Scale Percentages",
    "details": "Varying percentages of bid preference based on the cost of goods and services. See table for specific ranges and percentages."
  },
  {
    "item": "Native American Preference Requirement",
    "details": "Must meet the 11% native preference plus an additional 2% for Mohawk preference, totaling 13%."
  },
  {
    "item": "Mohawk Bid Eligibility Example",
    "details": "For a $48,000 bid, a Mohawk bidder's bid must be lower than $54,240 to be eligible for the award."
  },
  {
    "item": "Sliding Scale Calculation Formula",
    "details": "L x P + L = MB (Low Bidder Price x Percentage + Low Bidder Price = Max Bid). If Native bid is less than Max Bid, Native gets the award."
  },
  {
    "item": "Native American Preference Application",
    "details": "Applied to either proposal evaluation points or bid price, whichever has a higher preference value, after all bidders are qualified."
  },
  {
    "item": "Native American Preference Limitations",
    "details": "Cannot overcome lack of responsiveness, responsibility, or qualification of a bidder."
  },
  {
    "item": "Page Numbering",
    "details": "Document is numbered Page 5 of 12."
  },
  {
    "item": "Native American Preference Employment Plan",
    "details": "Successful bidders shall submit a Native American Preference Employment Plan to the SRMT Compliance Department."
  },
  {
    "item": "Mohawk Owned Business Registration/Certification",
    "details": "Individuals or Businesses registered/certified as Mohawk Owned Businesses shall be granted an extra 2% or 2 points in the evaluation for construction."
  },
  {
    "item": "Solicitation of Bids",
    "details": "The Tribe shall solicit construction contracts in accordance with the Tribe’s Contract and Procurement Policy."
  },
  {
    "item": "Native American Preference",
    "details": "Native American Preference may be applied as a percentage of identified proposal evaluation points, awarding 10%."
  },
  {
    "item": "Mohawk Preference",
    "details": "An additional 2% or 2 points for Mohawk individuals or businesses shall be applied if eligible."
  },
  {
    "item": "Native American Preference Application",
    "details": "The Native American/Mohawk Preference shall be applied to either proposal evaluation points and to proposal bid price, whichever has a higher preference value."
  },
  {
    "item": "Award Criteria",
    "details": "Award shall be made to the qualified company with the lowest responsible bid after the Native American Preference factor has been applied."
  },
  {
    "item": "NAOB Requirement",
    "details": "Native American Preference factor may be utilized for any bidder who is an approved NAOB that provides a Native American Preference Employment Plan."
  },
  {
    "item": "Construction - Native American Preference Employment Plan Requirement",
    "details": "All construction contracts awarded by the Tribe require a Native American Preference Employment Plan."
  },
  {
    "item": "Native American Preference Employment Plan",
    "details": "The successful General Contractor must provide a Native American Preference Employment Plan upon request of the SRMT Contracting Officer."
  },
  {
    "item": "Subcontractor Plan Submission",
    "details": "The General Contractor shall ensure all sub-contractors comply with the Native American Preference Employment Plan by submitting a Plan for each subcontractor after receipt of a Notice of Award and before the contract has been executed."
  },
  {
    "item": "Native American Employment Benchmarks",
    "details": "The General Contractor and all sub-contractors shall maintain the established 50% and 60% Native employment benchmarks throughout the duration of the project."
  },
  {
    "item": "Exemption Request",
    "details": "The General Contractor may request an exemption from the policy in writing to the Tribal Council with documented proof that there are fewer than 50% qualified Native American workers or 60% unskilled workers."
  },
  {
    "item": "List of Certified Native American Companies",
    "details": "The Compliance Department maintains a list of all certified Native American companies and will provide the list to potential bidders upon request."
  },
  {
    "item": "NAOB Certification Verification",
    "details": "The Grants and Contracts Office will verify the company's NAOB Certification with the SRMT Compliance Department."
  },
  {
    "item": "Akwesasne Employment Resource Center Reference",
    "details": "Include a statement referring General Contractors to the Akwesasne Employment Resource Center for Native American workers."
  },
  {
    "item": "Native American Preference Employment Plan Compliance",
    "details": "Contractors must comply with the Native American Preference Employment Plan unless a waiver is granted."
  },
  {
    "item": "Monthly Native American Preference Employment Plan Report",
    "details": "The Tribal Representative/Project Manager of each construction contract shall provide a monthly report."
  },
  {
    "item": "Native American Preference Employment Plan",
    "details": "General contractor must meet the Native American preference employment plan submitted."
  },
  {
    "item": "Waiver from Tribal Council",
    "details": "Contractor may need a waiver from Tribal Council if unable to meet the Native American preference employment plan."
  },
  {
    "item": "Financial Penalty for Non-Compliance",
    "details": "$250 or 10 % non-refundable fine per infraction, per trade per occurrence if Native American preference employment plan is not met and no waiver is granted."
  },
  {
    "item": "SRMT Construction/Service Contract Barring",
    "details": "Failure to meet the Native American preference employment plan (without a waiver) may result in barring from future SRMT construction and/or service contracts."
  },
  {
    "item": "Native American Owned Business Certification",
    "details": "Applicants seeking Native American Preference must submit proof of ownership and control to the Compliance Director."
  },
  {
    "item": "Ownership Requirements (Mohawk Owned Business)",
    "details": "Enrolled or eligible to be enrolled members of the SRMT must own 51% or more of the business."
  },
  {
    "item": "Control Requirements (Mohawk Owned Business)",
    "details": "Enrolled or eligible to be enrolled members of the SRMT must exercise majority control of the business, and be substantially involved in the management."
  },
  {
    "item": "Native American Ownership Requirement",
    "details": "At least 51% of the business must be owned by enrolled members of a federally recognized tribe, band, nation, including Alaska Native."
  },
  {
    "item": "Native American Control Requirement",
    "details": "Enrolled members must exercise majority control and be substantially involved in management and operations."
  },
  {
    "item": "Certification Application Submission",
    "details": "Submit a complete Mohawk/Native Owned Business Certification application to the Compliance Department Director."
  },
  {
    "item": "Application Location",
    "details": "The Application is available within the Compliance Department Office."
  },
  {
    "item": "Certification Fee",
    "details": "A set certification fee established by the Compliance Department and approved by Tribal Council shall be posted on the appendix of the application."
  },
  {
    "item": "Application Completion and Payment",
    "details": "Complete the application and submit receipt of payment to the Compliance Department before the application is examined."
  },
  {
    "item": "Certification Period",
    "details": "If verified, the Compliance Director shall issue a two-year certification to the Business."
  },
  {
    "item": "Recertification Required",
    "details": "Business must recertify."
  },
  {
    "item": "Biennial Application",
    "details": "Applications must be submitted every two years."
  },
  {
    "item": "Denial Notice",
    "details": "If denied, the Compliance Director shall issue a notice to the Business within five days of determination."
  },
  {
    "item": "Appeal Option",
    "details": "Business has the option to appeal denial decision to the SRMT Tribal Council."
  },
  {
    "item": "Investigation Initiation",
    "details": "Compliance Department Director may initiate an investigation based on credible reports or written grievances."
  },
  {
    "item": "Investigation Documentation",
    "details": "Concerns or statements of possible false documentation must be documented."
  },
  {
    "item": "Suspension/Withdrawal Notice",
    "details": "Director shall send Business notice of suspension via registered mail or email, along with the grounds for removing the certification."
  },
  {
    "item": "Appeal of Suspension/Withdrawal",
    "details": "Business may appeal any finding of certification withdrawal or suspension and submit counter documents."
  },
  {
    "item": "Reapplication Period",
    "details": "A Business that has had its certification withdrawn or suspended may not reapply for a period of one (1) year from the time it is withdrawn or suspended."
  },
  {
    "item": "Change in Status Reporting",
    "details": "Each certified firm shall report to the Compliance Department Director, in writing, any changes in its ownership or control status within thirty (30) days after such changes occur."
  },
  {
    "item": "Annual Update of Certified Firm Information",
    "details": "Each certified firm must update its information on an annual report form provided by the Compliance Department on the anniversary of its certification."
  },
  {
    "item": "Consequences of Failure to Provide Information",
    "details": "Failure to provide information as required shall constitute grounds for the Compliance Department Director to move for withdrawal of certification."
  },
  {
    "item": "Lobbying Certification Requirement",
    "details": "Contractor certifies that no Federal appropriated funds have been used for lobbying activities."
  },
  {
    "item": "Disclosure of Lobbying Activities with Non-Federal Funds",
    "details": "If funds other than Federal appropriated funds have been used for lobbying, the contractor must complete and submit Standard Form A-LLL \"Disclosure Form to Report Lobbying.\""
  },
  {
    "item": "Certification as Material Representation",
    "details": "The lobbying certification is a material representation of fact, and submission is a prerequisite for entering into the transaction."
  },
  {
    "item": "Penalty for Failure to File",
    "details": "Any person who fails to file the required lobbying certification shall be subject to a civil penalty."
  },
  {
    "item": "Certification Regarding Debarment",
    "details": "Contractor must certify regarding debarment status as required by Executive Order 12549 and 48 CFR Part 9.4."
  },
  {
    "item": "Debarment Status",
    "details": "Contractor must indicate whether they are presently debarred, suspended, proposed for debarment, or declared ineligible for contracts by any Federal, State, Local or Tribal Agency (checkmark required)."
  },
  {
    "item": "Conviction/Judgment History",
    "details": "Contractor must disclose any convictions or civil judgments within a 7-year period preceding the offer relating to fraud, antitrust, embezzlement, theft, forgery, bribery, falsification, tax evasion, etc. (checkmark required)."
  },
  {
    "item": "Offense History",
    "details": "Contractor must disclose any guilty pleas or convictions within a 7-year period preceding this offer, to any offense under Federal, State, Local or Tribal Law involving crimes of violence, sexual assault, sexual molestation, sexual exploitation, sexual contact or prostitution, or crimes against persons or has been convicted of an offense involving a child victim, a sex crime, or a drug felony (checkmark required)."
  },
  {
    "item": "Indictment/Charges",
    "details": "Contractor must disclose if they are presently indicted or criminally/civilly charged by a Governmental entity with commission of the offenses mentioned above (checkmark required)."
  },
  {
    "item": "Tribal Court Judgments",
    "details": "Contractor must disclose civil or criminal judgements rendered by a tribal court for any offense related to Indian Preference laws (including TERO provisions) (checkmark required)."
  },
  {
    "item": "Indian Contractor Status Certification",
    "details": "Contractor must certify regarding any judgments against them related to their status as an Indian contractor."
  },
  {
    "item": "Contract Termination History Certification",
    "details": "Contractor must certify whether they have had any contracts terminated for cause or default within the past 7 years."
  },
  {
    "item": "Written Notice of Erroneous Certification",
    "details": "Contractor must provide immediate written notice to the Contracting Officer if their certification was erroneous when submitted or becomes erroneous."
  },
  {
    "item": "Annual Recertification (Multi-Year Agreements)",
    "details": "Contractor must submit a recertification annually in a multi-year agreement."
  },
  {
    "item": "Furnishing Additional Information",
    "details": "Failure to furnish a certification or provide additional information requested by the Contracting Officer may render the Contractor non-responsible."
  },
  {
    "item": "Drug-Free Workplace Certification",
    "details": "Contractor must certify compliance with drug-free workplace requirements according to 48 CFR Part 23."
  },
  {
    "item": "Drug-Free Workplace Statement",
    "details": "Contractor must publish a statement notifying employees about drug-free workplace policies."
  },
  {
    "item": "Drug-Free Awareness Program",
    "details": "Contractor must establish a drug-free awareness program for employees."
  },
  {
    "item": "Employee Notification of Statement",
    "details": "Each employee must receive a copy of the drug-free workplace statement."
  },
  {
    "item": "Employee Agreement",
    "details": "Employees must agree to abide by the terms of the drug-free workplace statement and notify employer of drug-related convictions."
  },
  {
    "item": "Notification of Conviction to Owner",
    "details": "Contractor must notify the OWNER within ten days of receiving notice of an employee's drug-related conviction."
  },
  {
    "item": "Action after Conviction Notice",
    "details": "Contractor must take action within 30 days of receiving notice of an employee's drug-related conviction."
  },
  {
    "item": "Drug-Free Workplace Certification Requirement",
    "details": "Contractor must certify that they will maintain a drug-free workplace, taking actions against employees convicted of drug offenses and implementing a drug-free awareness program."
  },
  {
    "item": "Trafficking in Persons Compliance Plan Certification",
    "details": "Contractor certifies they have adopted a zero-tolerance policy regarding trafficking in persons and will notify employees of the policy and consequences of violation."
  },
  {
    "item": "Actions against Employees violating Trafficking Policy",
    "details": "Contractor must take appropriate action, up to and including termination, against employees or subcontractors that violate the zero-tolerance policy on trafficking in persons."
  },
  {
    "item": "Notification of Trafficking Violations",
    "details": "Contractor must immediately notify the Saint Regis Mohawk Tribe of any information alleging employees or subcontractors engaged in conduct violating the trafficking policy and any actions taken."
  },
  {
    "item": "Anti-Collusion Statement",
    "details": "Include a statement certifying that the offer was prepared without collusion and in compliance with the Sherman Anti-Trust Act."
  },
  {
    "item": "Anti-Collusion Statement Signature",
    "details": "Include the printed name of the contractor/company, printed name and title of the authorized representative, signature of the representative, and date signed on the Anti-Collusion Statement."
  },
  {
    "item": "Subcontract Clause",
    "details": "Include the substance of the non-compliance clause in all subcontracts."
  },
  {
    "item": "Updated CDC Guidance Reference",
    "details": "Proposals should reflect or align with the updated CDC guidance on respiratory viruses issued March 1st, 2024."
  },
  {
    "item": "Policy Naming Convention",
    "details": "Refer to the policy as the 'Respiratory Virus Workplace Safety Policy'."
  },
  {
    "item": "Version Number",
    "details": "Acknowledge the version number as 011."
  },
  {
    "item": "Doctor's Note Requirement",
    "details": "Sick leave exceeding three days due to COVID, RSV, or influenza requires a doctor's note, consistent with the SRMT Employee Handbook."
  },
  {
    "item": "Return to Work Criteria",
    "details": "Covered individuals may return to work 24 hours after symptoms improve, and when they have been fever-free for 24 hours without use of medication."
  },
  {
    "item": "Mask Requirement (Return to Work)",
    "details": "Surgical level or higher mask required for 5 calendar days upon returning to work."
  },
  {
    "item": "Telecommuting Arrangements",
    "details": "Arrangements and expectations established between supervisor and employee; schedules require supervisor approval."
  },
  {
    "item": "Telecommuting Availability",
    "details": "Employees must be available and responsive to work duties during designated hours."
  },
  {
    "item": "Response Time (Telecommuting)",
    "details": "Employees must respond to SRMT colleagues within 60 minutes (generally) and be available for phone calls."
  },
  {
    "item": "Security of Tribal Property (Telecommuting)",
    "details": "Staff are expected to secure all tribal property and data while telecommuting."
  },
  {
    "item": "Prohibited Use of Tribal Property (Telecommuting)",
    "details": "Use of tribal hardware and software by family members or non-employees is prohibited."
  },
  {
    "item": "Physical Presence of Leadership",
    "details": "Division Directors, Program Managers, and other Supervisors are expected to be physically present in the office as much as possible."
  },
  {
    "item": "Additional Program Measures",
    "details": "Tribal Programs may seek to establish additional, more stringent measures subject to review and approval of the Executive Director."
  },
  {
    "item": "Consequences of Violations",
    "details": "Violations of the policy are subject to disciplinary action, up to and including termination."
  },
  {
    "item": "Policy Amendments",
    "details": "The standards will be updated as public health officials provide new information or until the Employee Handbook is updated."
  },
  {
    "item": "Effective Date",
    "details": "This document shall take effect on the date of adoption by the Executive Director."
  },
  {
    "item": "Record Keeping",
    "details": "Contractor must keep records of work, quotations, contracts, correspondence, invoices, receipts, and vouchers related to the work."
  },
  {
    "item": "Access to Records",
    "details": "Contractor must make records available for copy, audit, or inspection by SRMT representatives."
  },
  {
    "item": "Ownership of Materials",
    "details": "All documents, reports, or other materials developed by the Contractor become the property of SRMT."
  },
  {
    "item": "Copyright Assignment",
    "details": "Contractor assigns all rights, title, and interest in the work, including copyright, to SRMT."
  },
  {
    "item": "Confidentiality",
    "details": "Contractor must treat all information as confidential during and after contract performance."
  },
  {
    "item": "Authority Limitations",
    "details": "Contractor does not have the authority to bind SRMT to any agreement."
  },
  {
    "item": "Conflict of Interest",
    "details": "Contractor must have no conflicting business, professional, personal, or other interests."
  },
  {
    "item": "Employee Conflict of Interest",
    "details": "No SRMT employee with authority over the agreement (or their immediate family) should have a direct or indirect financial interest in it."
  },
  {
    "item": "Conflict of Terms",
    "details": "In case of conflict between the proposal/quote and the contract, the terms of the contract shall control."
  },
  {
    "item": "Exclusion Database Screening",
    "details": "Contractors must be screened against the Department of Health & Human Services/Office of Inspector General and The System for Award Management (SAM) exclusion database prior to and for the duration of the contract."
  },
  {
    "item": "False Declaration",
    "details": "If a false declaration is made by the contractor, SRMT has the right to terminate the contract/agreement for default."
  },
  {
    "item": "Acts or Convictions",
    "details": "The Contractor and its affiliates must remain free and clear of specified acts or convictions during the contract."
  },
  {
    "item": "Native Preference",
    "details": "Preference for training and employment opportunities to be given to Indians, and preference in subcontract awards to be given to Indian organizations and Indian-owned economic enterprises as defined in 25 U.S. Code §1452."
  },
  {
    "item": "Electronic Signatures",
    "details": "Counterparts of the agreement and all ancillary documents may be executed and delivered by facsimile or other electronic signature."
  },
  {
    "item": "Certifications",
    "details": "Contractor must comply with the SRMT Combined Certifications (Certification Regarding Drug Free Work Place, Certification Regarding Debarment, Lobbying Certification, Certification Combating Trafficking in Persons and Anti-Collusion Statement)."
  },
  {
    "item": "Warranty Period",
    "details": "Materials, equipment, etc., shall be warranted for a period of twelve (12) months or warranted by manufacturer’s warranty, whichever is greater."
  },
  {
    "item": "Rights to Inventions",
    "details": "Contracts for the performance of experimental, development, or research work shall provide for the rights of the Federal Government and the recipient in any resulting invention in accordance with 37 CFR part 401 and any implementing regulations issued."
  },
  {
    "item": "Contract Work Hours and Safety Standards Act Compliance",
    "details": "Contracts in excess of $2,000 for Construction and $2,500 for other contracts that involve the employment of mechanics or laborers shall comply with Sections 102 and 107 of the Contract Work Hours and Safety Standards Act (40 USC 327-333), as supplemented by Department"
  },
  {
    "item": "Termination for Cause",
    "details": "Either party may terminate the agreement for cause in the event of any default by the other party. SRMT may terminate if the Contractor fails to comply with agreement terms and conditions or fails to provide assurances of future performance upon request."
  },
  {
    "item": "Contractor Liability Upon Termination for Cause",
    "details": "In the event of termination for cause, the SRMT shall not be liable to the Contractor for any amount for supplies or services not accepted, and the Contractor shall be liable to the SRMT for any and all rights and remedies provided by law."
  },
  {
    "item": "SRMT Improper Termination for Default",
    "details": "If the SRMT improperly terminated the contract for default, such termination shall be deemed a termination for convenience, so long as the SRMT has complied with the notice provisions set forth."
  },
  {
    "item": "Correction of Work",
    "details": "The Contractor shall be obligated to correct any incomplete, inaccurate or defective work at no further cost to the SRMT."
  },
  {
    "item": "Labor Regulations (29 CFR part 5)",
    "details": "Contractor shall compute the wages of every mechanic and laborer on the basis of a standard work week of 40 hours. Work in excess of the standard work week is permissible provided that the worker is compensated at the rate of not less than 1-1/2 times the basic rate of pay for all hours worked in excess of 40 hours in the work week."
  },
  {
    "item": "Working Conditions",
    "details": "No laborer or mechanic shall be required to work in surroundings or under working conditions which are unsanitary, hazardous or dangerous."
  },
  {
    "item": "Exemptions from Labor Regulations",
    "details": "These requirements do not apply to the purchases of supplies or materials or articles ordinarily available on the open market, or contracts for transportation or transmission of intelligence."
  },
  {
    "item": "Drug Free Workplace, Debarment and Suspension, Lobbying and Executive Order 11246",
    "details": "Compliance with Drug Free Workplace, Debarment and Suspension, Lobbying and Executive Order 11246 regulations during the performance of this contract."
  },
  {
    "item": "Drug Free Workplace Act Certification",
    "details": "Contractor must certify compliance with the Drug Free Workplace Act (1988) under US Code: Title 41, Chapter 10."
  },
  {
    "item": "Debarment and Suspension Certification",
    "details": "Contractor must certify compliance with Debarment and Suspension under Executive Order 12549."
  },
  {
    "item": "Lobbying Certification",
    "details": "Contractor must certify compliance with Certification Regarding Lobbying under Section 1352, Title 31 of the U.S. Code."
  },
  {
    "item": "Equal Employment Opportunity Compliance",
    "details": "Contractor must comply with Executive Order 11246, Equal Employment Opportunity, as amended, and shall not discriminate based on race, color, religion, sex, or national origin. The contractor should include this provision in every subcontract."
  },
  {
    "item": "Dispute Resolution Negotiation",
    "details": "All disputes arising under this contract shall be settled by negotiation."
  },
  {
    "item": "Dispute Resolution Written Notice",
    "details": "If informal negotiation efforts fail, the party asserting non-compliance shall serve written notice on the other party, identifying the specific provisions violated and the factual basis for the alleged non-compliance."
  },
  {
    "item": "Dispute Resolution Timeline",
    "details": "If the dispute is not resolved within sixty (60) days after service of notice, the parties may agree to pursue mediation."
  },
  {
    "item": "Contractor Performance During Dispute",
    "details": "Contractor shall proceed diligently with the performance of this contract during dispute resolution."
  },
  {
    "item": "Non-Discrimination Compliance (E.O. 11246)",
    "details": "Contractor must comply with the provisions of E.O. 11246, as amended, and shall not discriminate against any employee or applicant for employment because of race, color, religion, sex or national origin."
  },
  {
    "item": "Equal Opportunity for Workers with Disabilities",
    "details": "Contractor shall abide by the requirements of the equal opportunity clause at 41 CFR 60-741.5(a), as of March 24, 2014, prohibiting discrimination against qualified individuals on the basis of disability and requiring affirmative action."
  },
  {
    "item": "Subcontracting Requirements (Workers with Disabilities)",
    "details": "The Contractor shall include the terms of the equal opportunity for workers with disabilities clause in every subcontract or purchase order in excess of $15,000."
  },
  {
    "item": "Successors and Assigns",
    "details": "The Contract shall enure to the benefit of, and shall be binding upon, the successors and permitted assignees of the SRMT and of the Contractor."
  },
  {
    "item": "Minority and Women-Owned Business Enterprises (MWBE)",
    "details": "Contractor agrees to make every good faith effort to promote and assist the participation of certified Minority and women-owned Business enterprises (MWBEs) as subcontractors and suppliers."
  },
  {
    "item": "Equal Opportunity for Veterans",
    "details": "Compliance with the Equal Opportunity for Veterans clause (Oct 2015)."
  },
  {
    "item": "Safety Provisions Familiarization",
    "details": "Contractor must thoroughly familiarize themselves with safety provisions."
  },
  {
    "item": "Replacement of Personnel",
    "details": "Specific personnel named in the Agreement must perform the Work unless the Consultant/Contractor is unable to do so for reasons beyond its control."
  },
  {
    "item": "Equal Opportunity Clause Compliance",
    "details": "Contractor must abide by the equal opportunity clause at 41 CFR 50-300.5(a) as of March 24, 2014, prohibiting discrimination against qualified protected veterans and requiring affirmative action to employ and advance them."
  },
  {
    "item": "Subcontracting Clause",
    "details": "The Contractor shall insert the terms of the equal opportunity clause in subcontracts of $150,000 or more."
  },
  {
    "item": "Deficit Reduction Act (DRA) Compliance",
    "details": "Contractors, agents, vendors, and employees must comply with federal DRA requirements."
  },
  {
    "item": "Replacement Person Notification",
    "details": "Contractor must provide written notice to the SRMT at least 30 days (where possible) in advance of a replacement person commencing work. The notice must include the reason for removal and the replacement's qualifications and experience."
  },
  {
    "item": "SRMT Review of Replacement Person",
    "details": "SRMT has 15 calendar days after receipt of the notice to review the proposed replacement person. If no notification is received within this period, the proposal is considered accepted."
  },
  {
    "item": "Unauthorized Replacement Persons",
    "details": "The Consultant/Contractor shall not allow performance of the Work by unauthorized replacement persons."
  },
  {
    "item": "Corporate Compliance Plan Compliance",
    "details": "Consultant/Contractor must comply with SRMT's Corporate Compliance Plan available at https://dvc479a3doke3.cloudfront.net/_uploads/environment/FCAContractorVendorAgent-Letter1_2022.pdf."
  },
  {
    "item": "\"DRA\" Clause in Sub-contracts",
    "details": "Include the \"DRA\" clause in all Contractor's sub-contracts."
  },
  {
    "item": "Compliance with Federal Requirements",
    "details": "Comply with all applicable Federal requirements outlined in CFR Appendix II to Part 200."
  },
  {
    "item": "Rights to Inventions",
    "details": "Compliance with 37 CFR Part 401 (Rights to Inventions)."
  },
  {
    "item": "Contract Work Hours and Safety Standards Act",
    "details": "Compliance with 40 U.S.C. 327-333 (Contract Work Hours and Safety Standards Act) where applicable."
  },
  {
    "item": "Copeland Anti-Kickback Act",
    "details": "Compliance with 18 USC § 874 and 29 CFR Part 3 (Copeland Anti-Kickback Act)."
  },
  {
    "item": "Clean Air Act and Federal Water Pollution Control Act",
    "details": "Compliance with 42 USC §7401-7461q and 33 USC §251-1387 (Clean Air Act and Federal Water Pollution Control Act)."
  },
  {
    "item": "Domestic Preference for Procurements",
    "details": "Compliance with CFR 200.322 (Domestic Preference for Procurements)."
  },
  {
    "item": "Safety and Protection of Work",
    "details": "Contractor will be responsible for initiating, maintaining and supervising all safety precautions and programs in connection with the Work."
  },
  {
    "item": "Protection of Persons and Property",
    "details": "Contractor will take all necessary precautions for the safety of and will provide the necessary protection to prevent damage, injury or loss to all employees at the work site and all other persons who may be present."
  },
  {
    "item": "Respiratory Virus Workplace Safety Policy Compliance",
    "details": "Contractor shall conform to the SRMT’s Respiratory Virus Workplace Safety Policy and Contractor’s Safety Policy, and this shall be made a condition of each subcontract."
  },
  {
    "item": "Protection of Existing Vegetation, Structures, Equipment, Utilities, and Improvements",
    "details": "The Contractor shall preserve and protect all structures, equipment, and vegetation on or adjacent to the work sites, which are not to be removed and which do not unreasonably interfere with the work required under this Contract."
  },
  {
    "item": "Tree Removal Authorization",
    "details": "The Contractor shall remove trees only when specifically authorized to do so."
  },
  {
    "item": "Damage Repair Responsibility",
    "details": "The Contractor shall repair any damage to existing improvements and utilities resulting from failure to comply with the requirements of this Contract or failure to exercise reasonable care in performing the work."
  },
  {
    "item": "Accident Prevention and Safety Program",
    "details": "The Contractor shall be solely and completely responsible for conditions of the job site, including safety of all persons, employees, and property during performance of the work."
  },
  {
    "item": "Compliance with Laws and Regulations",
    "details": "Comply with U.S. Department of Labor (OSHA), all applicable Federal, State, County, and local laws (if applicable), and Tribal laws, ordinances, codes, and regulations."
  },
  {
    "item": "Document Version",
    "details": "Document version is V6, October 2023"
  },
  {
    "item": "Page Number",
    "details": "Example Page number is 3 of 3"
  }
]