[
  {
    "item": "Submission Deadline",
    "details": "February 25, 2025, 10:00 a.m. CDT"
  },
  {
    "item": "Submission Method",
    "details": "Submit proposal through Vendor Registry via the district’s website at https://www.hazelwoodschools.org/Page/2238"
  },
  {
    "item": "Required Forms",
    "details": "HSD Form A – MBE/WBE Subcontractor Utilization Form, HSD Form B - MBE/WBE Subcontractor Solicitation Form, Agreement for Contracted Services"
  },
  {
    "item": "Inquiry Deadline",
    "details": "Questions to be directed to Danielle Thomas no later than 2:00 pm on Tuesday, February 18, 2025"
  },
  {
    "item": "Inquiry Method",
    "details": "Submit questions through the Vendor Registry online question submission process via the district’s website at https://www.hazelwoodschools.org/Page/2238"
  },
  {
    "item": "Purpose of RFP",
    "details": "Soliciting proposals for an information technology audit for the Hazelwood School District (HSD)."
  },
  {
    "item": "District's Rights",
    "details": "The District may award a contract based upon the initial Proposals received without discussion. The District reserves the right to reject any or all Proposals and to waive informalities and minor irregularities in Proposals received."
  },
  {
    "item": "No Reimbursement for Proposal Costs",
    "details": "There is no expressed or implied obligation for the District to reimburse responding firms for any expense incurred in preparing Proposals is response to this request."
  },
  {
    "item": "Presentations/Interviews",
    "details": "The District may select a small number of Companies to make a presentation/attend an interview at the Company’s own expense. This may be virtual at the district’s discretion."
  },
  {
    "item": "Confidentiality Statement",
    "details": "If the proposal contains data the company wants to restrict from use or disclosure, the letter of transmittal must be marked with a specific confidentiality statement indicating the pages containing the restricted data."
  },
  {
    "item": "Confidentiality Statement Content",
    "details": "The confidentiality statement must follow the exact wording provided in the RFP."
  },
  {
    "item": "Restriction on Restrictive Language",
    "details": "Proposals shall not contain any restrictive language different from the specified confidentiality statement."
  },
  {
    "item": "District Liability for Unmarked Data",
    "details": "The District assumes no liability for disclosure or use of unmarked technical data."
  },
  {
    "item": "Page Limit (Total Proposal)",
    "details": "The proposal shall be limited to 12 pages, excluding the letter of transmittal, executive summary, attachments required by the District, and personnel resumes."
  },
  {
    "item": "Letter of Transmittal Requirement",
    "details": "Include a letter of transmittal that introduces the company and expresses the company's ability and desire to meet the RFP requirements. It should be signed by a company officer."
  },
  {
    "item": "Executive Summary Requirement",
    "details": "Include an executive summary that briefly describes the company's approach, indicates unmet requirements, and highlights major proposal features. It must be no longer than three (3) pages."
  },
  {
    "item": "Team Member Information",
    "details": "Include names, titles, and specific responsibilities of team members."
  },
  {
    "item": "Company Experience",
    "details": "Clearly indicate the Company’s prior experience in school district information technology audits, if applicable."
  },
  {
    "item": "Office Address",
    "details": "Give the address of the specific office which will have responsibility for performing the work."
  },
  {
    "item": "Personnel Qualifications",
    "details": "List the qualifications of personnel by discipline presently employed at the office specified above. Indicate prior experience in school district information technology audits, if applicable. List personnel only once under their primary discipline."
  },
  {
    "item": "Company Qualifications Discussion",
    "details": "Through narrative discussion, show reason why the Company believes it is especially qualified."
  },
  {
    "item": "Company Qualifications",
    "details": "Discuss any unique qualifications that the Company possesses which would be of a benefit to the District in the execution of this project."
  },
  {
    "item": "School IT Audit Experience",
    "details": "List recent examples of the Company’s school information technology audit experience during the last five (5) years. Include school district name, contact person, and phone number for each project."
  },
  {
    "item": "References",
    "details": "Include references from other School Districts with name, address and phone number of contact person. Only include references for projects completed in the past five (5) years."
  },
  {
    "item": "Litigation Disclosure",
    "details": "Indicate whether the company has been subject of any litigation through the discharge of its professional services. If so, provide a detailed description of the litigants, the subject matter, and the disposition of the arbitration or lawsuit."
  },
  {
    "item": "Attachment 1: Company Identification Form",
    "details": "Complete Attachment 1, “Company Identification Form.”"
  },
  {
    "item": "Attachment 2: References and Experience",
    "details": "Complete Attachment 2, “References and Experience,” including a listing of all Missouri school districts for which the company has provided services. Provide information on projects of a similar nature to that described in this RFP. Information on projects shall include the year the work was completed."
  },
  {
    "item": "Bid Pricing Sheet",
    "details": "Firms must ﬁll out the Bid Pricing sheet."
  },
  {
    "item": "Scope of Work Options",
    "details": "Firms can submit a proposal for auditing all items or speciﬁc items individually, both proposals will be considered."
  },
  {
    "item": "Indicate additional areas for assessment/improvement",
    "details": "Proposers should indicate any areas where the district's information technology could be assessed or improved through an audit process, even if not specified in sections 7.1 through 7.5."
  },
  {
    "item": "Pricing for additional items",
    "details": "Any items and pricing not already included in another area should be indicated in the pricing page as a separate line item(s)."
  },
  {
    "item": "Company Introduction, History, and Qualifications",
    "details": "Provide an introduction of the company, its history, and qualifications for the project."
  },
  {
    "item": "Description of Data Acquisition Methods",
    "details": "Describe the methods and processes to be used in acquiring data."
  },
  {
    "item": "Relevant Experience with School Districts and IT Audits",
    "details": "Describe work experience with school districts and information technology audits in the last five (5) years; provide contact names, phone numbers, and e-mail addresses of at least three (3) clients."
  },
  {
    "item": "Brief Description of Firm Services and Benefits to District",
    "details": "Briefly describe the services the firm provides and how those services will benefit the District."
  },
  {
    "item": "Description of Data Required from the District",
    "details": "Describe data that will need to be provided by the District to assist in the analysis and projections."
  },
  {
    "item": "Detailed Description of Audit Process and Methodology",
    "details": "Provide a detailed description of the audit process and methodology with data collection and analysis techniques."
  },
  {
    "item": "Proposed Timeline for Audit Completion",
    "details": "Include a proposed timeline for completion of the audit."
  },
  {
    "item": "Sample Technology Audit Report",
    "details": "Provide a sample technology audit report from a previous client (with confidential information redacted)."
  },
  {
    "item": "Comprehensive Written Report",
    "details": "Provide a comprehensive written report detailing findings and recommendations."
  },
  {
    "item": "Executive Summary",
    "details": "Provide an executive summary for district leadership and school board."
  },
  {
    "item": "Presentation of Findings",
    "details": "Provide a presentation of findings to district leadership (and school board if required)."
  },
  {
    "item": "Prioritized Recommendations",
    "details": "Provide prioritized recommendations that are broken into the areas covered in the scope of work."
  },
  {
    "item": "Suggested Key Performance Indicators (KPI)",
    "details": "Suggest Key Performance Indicators (KPI) for measuring future success."
  },
  {
    "item": "Responsiveness and Completeness",
    "details": "Ensure responsiveness and completeness of the proposal, including providing all information requested in the RFP."
  },
  {
    "item": "Understanding of RFP Requirements",
    "details": "Demonstrate understanding of and ability to address the RFP requirements."
  },
  {
    "item": "Experience and References",
    "details": "Provide experience and references of similar sized school district clients."
  },
  {
    "item": "Cost",
    "details": "Include cost information."
  },
  {
    "item": "Ability to Provide Services",
    "details": "Demonstrate the ability to provide the requested services."
  },
  {
    "item": "Project Approach",
    "details": "Provide a logical, organized, innovative approach and demonstrate understanding and experience with similar projects."
  },
  {
    "item": "Company Identification Form",
    "details": "Complete and return the Company Identification Form (Attachment 1). Designate a company representative to the District during the agreement term. By signing, the company agrees to be bound by the terms of the RFP and certifies no conflicts of interest exist."
  },
  {
    "item": "Proposal Validity Period",
    "details": "Acknowledge that the terms and conditions set forth in the Proposal will remain open for at least 90 days from the deadline for submission of Proposals."
  },
  {
    "item": "References and Experience",
    "details": "Submit a minimum of five (5) references (Attachment 2). Each reference must be presently using..."
  },
  {
    "item": "Reference Information",
    "details": "Provide references for services similar to those requested in the RFP."
  },
  {
    "item": "Reference Affiliation Restriction",
    "details": "References cannot be affiliates of the Company or the Company's officers, directors, shareholders, or partners."
  },
  {
    "item": "Reference Type Preference",
    "details": "List current contracts for demographer services with public school districts as primary references."
  },
  {
    "item": "Reference Contact Information",
    "details": "Include contacts and telephone numbers for each reference."
  },
  {
    "item": "Reference Form Structure",
    "details": "Follow the provided template for each reference, including Company Name, Business Address, Contact Name and Title, Contact Phone Number, Contract Length, and Contract Value."
  },
  {
    "item": "Attachment Label",
    "details": "Include Attachment 2 - References and Experience"
  },
  {
    "item": "Termination for Default Disclosure",
    "details": "Disclose all contracts terminated for default within the last five (5) years, providing full details."
  },
  {
    "item": "Definition of Termination for Default",
    "details": "Termination for default is defined as notice to stop performance due to Company’s nonperformance or poor performance."
  },
  {
    "item": "No Termination for Default Indication",
    "details": "If the Company has experienced no terminations for default in the past five (5) years, so indicate."
  },
  {
    "item": "Company Information",
    "details": "Provide Company Name, Business Address, Contact Name, Contact Title, and Contact Phone Number."
  },
  {
    "item": "Contract Length",
    "details": "Provide the proposed contract length."
  },
  {
    "item": "Contract Value",
    "details": "Provide the proposed contract value."
  },
  {
    "item": "Proposal Validity",
    "details": "Proposals shall be considered valid for a minimum of 60 days."
  },
  {
    "item": "Ownership of Submittals",
    "details": "All completed proposals submitted in response to this RFP become the property of the District upon submission."
  },
  {
    "item": "Price Stability",
    "details": "Services must be furnished at submitted fees/costs/rates. No cost increases permitted during the contract term."
  },
  {
    "item": "Contract Approval Timeline",
    "details": "Hazelwood School Board of Education approval anticipated within 60 days of proposed submission."
  },
  {
    "item": "Contract Execution",
    "details": "Successful proposer required to enter a written contract with the District."
  },
  {
    "item": "Return of Executed Contract and Documents",
    "details": "Vendor shall return properly executed contract copies, insurance certificates, bonds, etc., within seven (7) working days after receipt."
  },
  {
    "item": "Invoice Submission",
    "details": "Invoices to be submitted via email to accountspayable@hazelwoodschools.org or mailed to 15955 New Halls Ferry Road, Florissant, MO 63031."
  },
  {
    "item": "Invoice Content",
    "details": "Each invoice should contain the District purchase order number, date of shipment, quantity, price and item(s) shipped."
  },
  {
    "item": "Payment Terms",
    "details": "Hazelwood School District’s payment terms are Net 45 days."
  },
  {
    "item": "Comprehensive General Liability Insurance",
    "details": "$1,000,000 per person per occurrence (Including Contractual Liability), $1,000,000 property damage per occurrence, $1,000,000 aggregate all claims per occurrence"
  },
  {
    "item": "Workers’ Compensation Insurance",
    "details": "As required by applicable law"
  },
  {
    "item": "Employer’s Liability Insurance",
    "details": "$1,000,000 per occurrence"
  },
  {
    "item": "Automotive Liability Insurance",
    "details": "Unspecified, but required"
  },
  {
    "item": "Insurance Requirements - General Liability",
    "details": "$1,000,000 per occurrence"
  },
  {
    "item": "Insurance Requirements - Professional Errors and Omissions",
    "details": "$1,000,000 per occurrence"
  },
  {
    "item": "Taxes",
    "details": "Do NOT include FEDERAL EXCISE TAX, TRANSPORTATION TAX, or STATE RETAIL SALES TAX in the cost proposal."
  },
  {
    "item": "No Participation",
    "details": "The successful Proposer shall not directly or indirectly participate as a proposer, bidder, or subcontractor to a proposer or bidder on any bids or request for proposals related to this RFP's projects."
  },
  {
    "item": "Use of Information",
    "details": "All information furnished remains the property of the District and must be returned upon request.  Information must be held in confidence and used only for the purposes of this RFP."
  },
  {
    "item": "Confidentiality",
    "details": "No information furnished by any interested party to the District under this RFP shall be considered confidential or proprietary."
  },
  {
    "item": "District Policies",
    "details": "The successful Proposer shall be required to follow all District policies, including those regarding confidentiality of student records."
  },
  {
    "item": "Permits and Fees",
    "details": "The vendor shall secure and pay for all permits and governmental fees necessary for the proper execution."
  },
  {
    "item": "Compliance with Laws",
    "details": "Vendor must comply with all applicable laws, ordinances, rules, regulations, and orders."
  },
  {
    "item": "Proposal Price Sheet",
    "details": "Provide a proposal price sheet with columns for: Deliverable, Ability to Provide Service (yes/no), Bid Amount"
  },
  {
    "item": "Deliverable 7.1",
    "details": "Current Technology Landscape Assessment: Evaluate existing IT infrastructure, hardware, software, and network capabilities. Assess organizational effectiveness, application support and business continuity management. Assess classroom and administrative office technology integration. Review special program technology needs."
  },
  {
    "item": "Deliverable 7.2",
    "details": "Device Management and Refresh Planning: Assess current device inventory and management for both staff and students. Evaluate the existing device refresh cycle and recommend improvements. Analyze total cost of ownership (TCO) for various device options. Provide recommendations for a 4-year device refresh plan."
  },
  {
    "item": "Deliverable 7.3",
    "details": "Infrastructure and Network Evaluation: Assess current network infrastructure. Evaluate bandwidth capacity and internet connectivity. Review network security measures and data protection strategies. Assess systems lifecycles, data management, system implementation, data loss prevention, data privacy, identity access management"
  },
  {
    "item": "Deliverable 7.4",
    "details": "Professional Development and Training Assessment: Review current technology-related professional development offerings. Assess the effectiveness of existing training programs. Recommend improvements for ongoing coaching and support mechanisms"
  },
  {
    "item": "Deliverable 7.5",
    "details": "Technical Support and Maintenance Evaluation: Analyze current IT support structure and staffing levels. Assess help desk operations and service delivery"
  },
  {
    "item": "Company Name",
    "details": "Provide the company's legal name."
  },
  {
    "item": "Address",
    "details": "Provide the company's full address."
  },
  {
    "item": "City/Zip",
    "details": "Provide the company's city and zip code."
  },
  {
    "item": "Fax",
    "details": "Provide the company's fax number."
  },
  {
    "item": "Phone",
    "details": "Provide the company's phone number."
  },
  {
    "item": "Federal Tax ID",
    "details": "Provide the company's Federal Tax ID."
  },
  {
    "item": "Authorized Company Official Print Name",
    "details": "Print the name of the authorized company official."
  },
  {
    "item": "Authorized Company Official Signature",
    "details": "Signature of the authorized company official."
  },
  {
    "item": "Date",
    "details": "Provide the date of signature."
  },
  {
    "item": "Email Address",
    "details": "Provide the company's email address."
  },
  {
    "item": "Cost/Fee Structure Page",
    "details": "May include a separate page for cost/fee structure."
  },
  {
    "item": "Supplier Diversity Program Compliance",
    "details": "Adherence to the Hazelwood School District Supplier Diversity Program, including participation goals for MBEs (25%) and WBEs (5%) on construction projects."
  },
  {
    "item": "Supplier Diversity Program Document",
    "details": "The Hazelwood School District Supplier Diversity Program can be downloaded from the district’s website at www.hazelwoodschools.org."
  },
  {
    "item": "MBE/WBE Certification",
    "details": "Must be certified by City of St. Louis, SLMSDC, MRCC, State Certifications, NMSDC, or WBENC (or affiliates) on or before the proposal opening date."
  },
  {
    "item": "MBE/WBE Certification for Manufacturers",
    "details": "District will also accept MBE/WBE certification by any state division of purchasing or the National Minority Supplier Development Council and its affiliates."
  },
  {
    "item": "Proposal Withdrawal Period",
    "details": "No Proposal may be withdrawn for a period of 60 days subsequent to the specified time for receipt of proposals."
  },
  {
    "item": "Subcontractor Utilization Form Location",
    "details": "The entire Supplier Diversity program including forms A and B are located within the Supplier Diversity document."
  },
  {
    "item": "Subcontractor Utilization Form",
    "details": "Form must include Work or Trade, MBE/WBE Firm Name, Subcontract Amount to be Subcontracted or Joint Venture (MBE/WBE), and total bid information."
  },
  {
    "item": "MBE/WBE Certification on Form A",
    "details": "Must be certified MBE/WBE on Form A to have the portion of work counted towards the goal."
  },
  {
    "item": "HSD Form A",
    "details": "Complete and submit HSD Form A."
  },
  {
    "item": "HSD Form B",
    "details": "Complete and submit HSD Form B (MBE/WBE Subcontractor Solicitation Report)."
  },
  {
    "item": "E-Verify Affidavit",
    "details": "Provide an affidavit affirming the use of E-Verify and that the business does not employ illegal workers if the contract exceeds $5,000."
  },
  {
    "item": "OSHA Training Documentation",
    "details": "Provide documentation of a ten (10) hour OSHA construction safety program for on-site workers (if applicable)."
  },
  {
    "item": "Client References",
    "details": "Supply at least three (3) client references for completed work in the last 1-2 years, including organization name, address, phone, contact person, project description, and contract amount."
  },
  {
    "item": "Business Entity Certification",
    "details": "Certify current business status by completing Box A, Box B, or Box C on the Exhibit."
  },
  {
    "item": "Business Entity Definition",
    "details": "Must meet the definition of a business entity as defined in section 285.525, RSMo pertaining to section 285.530, RSMo."
  },
  {
    "item": "Certification of Business Entity Status",
    "details": "Provide certification whether the company/individual meets the definition of a business entity. If not, indicate the reason."
  },
  {
    "item": "Alien Status Certification",
    "details": "Certify that you are not an alien unlawfully present in the United States."
  },
  {
    "item": "Business Status Change Notification",
    "details": "Notify if the business status changes during the life of the contract to become a business entity."
  },
  {
    "item": "Work Authorization Affidavit",
    "details": "Consultants/contractors meeting the definition of a business entity per section 285.525, RSMo must complete and return the Affidavit of Work Authorization."
  },
  {
    "item": "E-Verify Enrollment",
    "details": "Business entities must affirm that they are enrolled and will continue to participate in the E-Verify federal work authorization program for employees hired after enrollment who are proposed to work on the contract."
  },
  {
    "item": "Unauthorized Alien Employment",
    "details": "Business entities must affirm that they do not and will not knowingly employ an unauthorized alien in connection with the contracted services."
  },
  {
    "item": "Box Completion based on Business Entity Status",
    "details": "Complete Box A if a non-business entity. Complete Box B if a business entity who has not completed and submitted documentation per the federal work authorization program. Complete Box C if a business entity with current work authorization documentation on file with a Missouri state agency."
  },
  {
    "item": "Box B Requirements",
    "details": "If Box B is completed, comply with the requirements stated in Box B and provide all documentation required in Box B."
  },
  {
    "item": "False Statement Penalties",
    "details": "Understands that false statements made in this filing are subject to the penalties provided under section 575.040, RSMo."
  },
  {
    "item": "Authorized Representative Signature",
    "details": "Must include the Authorized Representative’s Signature."
  },
  {
    "item": "Printed Name",
    "details": "Must include the Printed Name of the Authorized Representative."
  },
  {
    "item": "Title",
    "details": "Must include the Title of the Authorized Representative."
  },
  {
    "item": "Date",
    "details": "Must include the Date of the signature."
  },
  {
    "item": "E-Mail Address",
    "details": "Must include the E-Mail Address of the Authorized Representative."
  },
  {
    "item": "E-Verify Company ID Number",
    "details": "Must include the E-Verify Company ID Number."
  },
  {
    "item": "Notary Public Information",
    "details": "Requires a Notary Public's signature, date, county, state, and commission expiration date."
  },
  {
    "item": "BOX B Completion (if no E-Verify/Affidavit on file)",
    "details": "Complete Box B if you DO NOT have the E-Verify documentation and a current Affidavit of Work Authorization already on file with the State of Missouri."
  },
  {
    "item": "Business Entity Definition",
    "details": "Certify that the Business Entity Name meets the definition in section 285.525, RSMo, pertaining to section 285.530."
  },
  {
    "item": "Business Entity Representative Information",
    "details": "Requires Authorized Business Entity Representative’s Name, Signature, Business Entity Name, Date, and E-Mail Address."
  },
  {
    "item": "E-Verify Enrollment and Participation",
    "details": "Enroll and participate in the E-Verify federal work authorization program (Website: www.e-verify.gov; Phone: 888-464-4218; Email: e-verify@dhs.gov) with respect to the employees hired after enrollment in the program who are proposed to work in connection with the services required herein."
  },
  {
    "item": "E-Verify Documentation",
    "details": "Provide documentation affirming said company’s/individual’s enrollment and participation in the E-Verify federal work authorization program."
  },
  {
    "item": "E-Verify Employment Eligibility Verification Page",
    "details": "Documentation shall include EITHER the E-Verify Employment Eligibility Verification page listing the consultant’s/contractor"
  },
  {
    "item": "E-Verify Documentation",
    "details": "Submit either the E-Verify Employment Eligibility Verification page OR a page from the E-Verify Memorandum of Understanding (MOU) listing the consultant’s/contractor’s name and the MOU signature page completed and signed, at minimum, by the consultant/contractor and the Department of Homeland Security – Verification Division."
  },
  {
    "item": "Affidavit of Work Authorization",
    "details": "Submit a completed, notarized Affidavit of Work Authorization."
  },
  {
    "item": "Affidavit on File Certification (Box C)",
    "details": "If documentation is on file with Missouri, certify that the business entity meets the definition in section 285.525, RSMo, pertaining to section 285.530, RSMo, and participates in E-Verify. Indicate that E-Verify documentation and Affidavit have previously been provided."
  },
  {
    "item": "Previous Documentation Details (Box C)",
    "details": "If using Box C, indicate the name of the Missouri State Agency or Public University where documentation was previously submitted."
  },
  {
    "item": "Affidavit Age",
    "details": "A current, notarized Affidavit of Work Authorization (must be completed, signed, and notarized within the past twelve months)."
  },
  {
    "item": "E-Verify Documentation Submission",
    "details": "Provide details of previous E-Verify documentation submission if applicable, including date, RFP/RFQ number, and authorized representative information."
  },
  {
    "item": "E-Verify MOU Company ID Number",
    "details": "Provide the E-Verify MOU Company ID Number."
  },
  {
    "item": "Contractor Information",
    "details": "Provide contractor's name, address, city, state, zip code, telephone number, and tax identification number (or Social Security Number)."
  },
  {
    "item": "Contract Execution",
    "details": "The successful contractor will be required to enter into a contract with the Owner per the proposal specifications and proposal submission."
  },
  {
    "item": "Contractor Signature",
    "details": "Contractor's signature and date required."
  },
  {
    "item": "Notary Public",
    "details": "Subscribed and sworn to before a Notary Public with commission expiration date."
  },
  {
    "item": "MBE/WBE Subcontractor Utilization Form",
    "details": "Submit HSD FORM A"
  },
  {
    "item": "MBE/WBE Subcontractor Solicitation Form",
    "details": "Submit HSD FORM B"
  },
  {
    "item": "Proposal Response Sheet",
    "details": "Submit a Proposal Response Sheet"
  },
  {
    "item": "E-Verify Affidavits",
    "details": "Submit E-Verify Affidavits"
  },
  {
    "item": "Completed W-9",
    "details": "Submit a Completed W-9 form"
  },
  {
    "item": "Agreement for Contracted Services",
    "details": "Submit an Agreement for Contracted Services"
  },
  {
    "item": "RFP Proposal",
    "details": "Submit the complete RFP Proposal"
  }
]