[
  {
    "item": "Submission Deadline",
    "details": "February 25, 2025, 10:00 a.m. CDT"
  },
  {
    "item": "Submission Method",
    "details": "Submit through Vendor Registry via the district’s website at https://www.hazelwoodschools.org/Page/2238"
  },
  {
    "item": "Required Forms",
    "details": "HSD Form A – MBE/WBE Subcontractor Utilization Form, HSD Form B - MBE/WBE Subcontractor Solicitation Form, Agreement for Contracted Services"
  },
  {
    "item": "Inquiries Deadline",
    "details": "Questions to Danielle Thomas, Director of Purchasing & Supplier Diversity, no later than 2:00 pm on Tuesday, February 18, 2025 through Vendor Registry"
  },
  {
    "item": "Inquiries Method",
    "details": "Questions submitted through Vendor Registry online question submission process via the district’s website at https://www.hazelwoodschools.org/Page/2238"
  },
  {
    "item": "Technical Data Restriction Statement",
    "details": "If the Proposal contains data the Company does not want used or disclosed for evaluation purposes only, the letter of transmittal must be marked with the specific restriction statement provided in the RFP, indicating the relevant page numbers."
  },
  {
    "item": "Technical Data Restriction Statement Restriction",
    "details": "Proposals shall not contain any restrictive language different from the statement provided in the RFP for technical data."
  },
  {
    "item": "Unmarked Technical Data",
    "details": "The District assumes no liability for disclosure or use of unmarked technical data and may use or disclose the data for any reason."
  },
  {
    "item": "Page Limit",
    "details": "Proposals must be limited to 12 pages, excluding the letter of transmittal, executive summary, required attachments, and personnel resumes."
  },
  {
    "item": "Letter of Transmittal",
    "details": "Include a Letter of Transmittal introducing the company and expressing the company's ability and desire to meet the RFP requirements. It must be signed by a company officer."
  },
  {
    "item": "Executive Summary",
    "details": "Include an Executive Summary that briefly describes the Company’s approach, indicates any major requirements than cannot be met, and highlights the major features of the Proposal. The Executive Summary must be no longer than three (3) pages."
  },
  {
    "item": "Team Member Information",
    "details": "Include names, titles and specific responsibilities of team members and clearly indicate the Company’s prior experience in school district information technology audits, if applicable."
  },
  {
    "item": "Office Address",
    "details": "Provide the address of the specific office that will be responsible for performing the work."
  },
  {
    "item": "Personnel Qualifications",
    "details": "List the qualifications of personnel by discipline presently employed at the specified office, as of the date of the proposal. Clearly indicate prior experience in school district information technology audits, if applicable."
  },
  {
    "item": "Company Qualifications",
    "details": "Through narrative discussion, show reason why the Company believes it is especially qualified."
  },
  {
    "item": "Company Qualifications Discussion",
    "details": "Discuss any unique qualifications that the Company possesses which would be of a benefit to the District in the execution of this project."
  },
  {
    "item": "School Information Technology Audit Experience",
    "details": "List recent examples of the Company’s school information technology audit experience during the last five (5) years. For each project, indicate the name of school district, contact person, and phone number."
  },
  {
    "item": "References from other School Districts",
    "details": "Include references from other School Districts with name, address and phone number of contact person. Only include references for which the Company has completed projects in the past five (5) years."
  },
  {
    "item": "Litigation Disclosure",
    "details": "Indicate whether the Company has been the subject of any litigation through the discharge of its professional services. If so, provide a detailed description of the litigants, the subject matter, and the disposition of the arbitration or lawsuit."
  },
  {
    "item": "Attachment 1: Company Identification Form",
    "details": "The Company must complete Attachment 1, “Company Identification Form.”"
  },
  {
    "item": "Attachment 2: References and Experience",
    "details": "The Company must complete Attachment 2, “References and Experience,” including a listing of all Missouri school districts for which the company has provided services. The Company should provide information on projects of a similar nature to that described in this RFP. Information on projects shall include the year the work was completed."
  },
  {
    "item": "Bid Pricing Sheet",
    "details": "Firms must ﬁll out the Bid Pricing sheet."
  },
  {
    "item": "Company Introduction, History, and Qualifications",
    "details": "Provide an introduction of your company, including its history and qualifications for this project."
  },
  {
    "item": "Description of Data Acquisition Methods",
    "details": "Describe the methods and processes that will be used to acquire data."
  },
  {
    "item": "Relevant Work Experience",
    "details": "Describe work experience with school districts and information technology audits in the last five (5) years. Provide contact names, phone numbers, and e-mail addresses of at least three (3) clients."
  },
  {
    "item": "Firm Services and Benefits to the District",
    "details": "Briefly describe the services the firm provides and how those services will benefit the District."
  },
  {
    "item": "Data Required from the District",
    "details": "Describe data that will need to be provided by the District to assist in the analysis and projections."
  },
  {
    "item": "Detailed Audit Process Description",
    "details": "Provide a detailed description of the audit process and methodology with data collection and analysis techniques."
  },
  {
    "item": "Proposed Timeline",
    "details": "Propose a timeline for completion of the audit."
  },
  {
    "item": "Sample Audit Report",
    "details": "Submit a sample technology audit report from a previous client, with confidential information redacted."
  },
  {
    "item": "Comprehensive Written Report Deliverable",
    "details": "Provide a comprehensive written report detailing findings and recommendations."
  },
  {
    "item": "Executive Summary Deliverable",
    "details": "Provide an executive summary for district leadership and school board."
  },
  {
    "item": "Presentation of Findings Deliverable",
    "details": "Provide a presentation of findings to district leadership (and school board if required)."
  },
  {
    "item": "Prioritized Recommendations Deliverable",
    "details": "Provide prioritized recommendations that are broken into the areas covered in the scope of work."
  },
  {
    "item": "Suggested Key Performance Indicators (KPI) Deliverable",
    "details": "Provide suggested Key Performance Indicators (KPI) for measuring future success."
  },
  {
    "item": "Responsiveness and Completeness",
    "details": "Ensure responsiveness and completeness of the vendor’s proposal, including whether or not the vendor has provided all information requested in the RFP."
  },
  {
    "item": "Understanding of RFP Requirements",
    "details": "Demonstrate proposers understanding of and ability to address the RFP requirements."
  },
  {
    "item": "Experience and References",
    "details": "Show proposers experience and reference of similar sized school district clients"
  },
  {
    "item": "Cost",
    "details": "Include Cost."
  },
  {
    "item": "Ability to Provide Services",
    "details": "Demonstrate proposers ability to provide the requested services."
  },
  {
    "item": "Project Approach",
    "details": "Illustrate a logical, organized, innovative understanding, and experience with similar"
  },
  {
    "item": "Company Identification Form",
    "details": "Complete and submit Attachment 1, designating a company representative for contact during the evaluation period. Agree to be bound by the RFP terms and certify no conflicts of interest exist."
  },
  {
    "item": "Proposal Validity Period",
    "details": "Acknowledge that the proposal terms and conditions will remain open for at least 90 days from the submission deadline."
  },
  {
    "item": "References and Experience",
    "details": "Submit a minimum of five references currently using the Company's services."
  },
  {
    "item": "Submission Deadline",
    "details": "Deadline for submission of proposals is 02/25/2025"
  },
  {
    "item": "MBE/WBE Participation",
    "details": "Demonstrate commitment to MBE/WBE participation."
  },
  {
    "item": "Reference Requirement",
    "details": "Provide references for services similar to those requested in the RFP. References cannot be affiliated with the Company, its officers, directors, shareholders, or partners."
  },
  {
    "item": "Primary References",
    "details": "List current contracts for demographer services with public school districts as primary references."
  },
  {
    "item": "Reference Contact Information",
    "details": "Include contacts and telephone numbers for each reference."
  },
  {
    "item": "Additional Pages",
    "details": "Use additional pages for additional contracts if needed."
  },
  {
    "item": "Attachment 2 Title",
    "details": "Attachment 2: References and Experience"
  },
  {
    "item": "Terminations for Default",
    "details": "Note any contracts terminated for default within the last five (5) years. Default is defined as notice to stop performance due to nonperformance or poor performance."
  },
  {
    "item": "Details of Terminations",
    "details": "Submit full details of all terminations for default experienced."
  },
  {
    "item": "No Terminations Indication",
    "details": "If the Company has experienced no terminations for default in the past five (5) years, so indicate."
  },
  {
    "item": "Company Information",
    "details": "Provide Company Name, Business Address, Name of Contact, Title of Contact, Phone Number of Contact."
  },
  {
    "item": "Proposal Validity",
    "details": "All proposals shall be considered valid for a minimum of 60 days."
  },
  {
    "item": "Ownership of Submittals",
    "details": "All completed proposals submitted in response to this RFP become the property of the District upon submission."
  },
  {
    "item": "Price Commitment",
    "details": "Services must be furnished at the fees, costs and/or rates submitted and proposed. No cost increases permitted during the contract term."
  },
  {
    "item": "Contract Approval Timeline",
    "details": "Award of contract(s) or agreement to purchase anticipated to be within 60 days of proposed submission."
  },
  {
    "item": "Contract Return Timeline",
    "details": "Vendor shall return properly executed copies of contract along with required certificates of insurance, bonds, etc., within seven (7) working days after their receipt."
  },
  {
    "item": "Invoice Submission",
    "details": "Invoices submitted via email at accountspayable@hazelwoodschools.org or mailed to 15955 New Halls Ferry Road, Florissant, MO 63031."
  },
  {
    "item": "Invoice Content",
    "details": "Each invoice should contain the District purchase order number, date of shipment, quantity, price and item(s) shipped."
  },
  {
    "item": "Payment Terms",
    "details": "Hazelwood School District’s payment terms are Net 45 days."
  },
  {
    "item": "Comprehensive General Liability Insurance",
    "details": "$1,000,000 per person per occurrence (Including Contractual Liability), $1,000,000 property damage per occurrence, $1,000,000 aggregate all claims per occurrence"
  },
  {
    "item": "Workers’ Compensation Insurance",
    "details": "As required by applicable law"
  },
  {
    "item": "Employer’s Liability Insurance",
    "details": "$1,000,000 per occurrence"
  },
  {
    "item": "Automotive Liability Insurance",
    "details": "Requirement Exists but limits not specified in provided text."
  },
  {
    "item": "Insurance Requirements - General Liability",
    "details": "$1,000,000 per occurrence"
  },
  {
    "item": "Insurance Requirements - Professional Errors and Omissions",
    "details": "$1,000,000 per occurrence"
  },
  {
    "item": "Taxes",
    "details": "Do NOT include Federal Excise Tax, Transportation Tax, or State Retail Sales Tax in the cost proposal."
  },
  {
    "item": "No Participation",
    "details": "The successful Proposer shall not participate as a proposer, bidder, or subcontractor on related bids or RFPs."
  },
  {
    "item": "Use of Information",
    "details": "Any Information furnished or disclosed under this RFP shall remain the property of the District and must be returned upon request. Must be held in confidence."
  },
  {
    "item": "Policies and Confidentiality",
    "details": "The successful Proposer shall follow all District policies, including those regarding confidentiality of student records."
  },
  {
    "item": "Permits and Fees",
    "details": "The vendor shall secure and pay for all permits and governmental fees necessary."
  },
  {
    "item": "Compliance with Laws and Regulations",
    "details": "Vendor must comply with all applicable laws, ordinances, rules, regulations, and orders."
  },
  {
    "item": "Proposal Price Sheet",
    "details": "Provide bid amount for each deliverable (7.1-7.5) in the specified format."
  },
  {
    "item": "Ability to Provide Service",
    "details": "Indicate 'yes' or 'no' for each deliverable (7.1-7.5) to confirm ability to provide the service."
  },
  {
    "item": "Cost/Fee Structure",
    "details": "May include separate page for cost/fee structure."
  },
  {
    "item": "Supplier Diversity Program",
    "details": "MBE participation goal: 25% on construction projects."
  },
  {
    "item": "Supplier Diversity Program",
    "details": "WBE participation goal: 5% on construction projects."
  },
  {
    "item": "Workforce Goals",
    "details": "Encourages workforce goal of 25% minority and 5% women."
  },
  {
    "item": "Proposal Rejection",
    "details": "District may reject proposals that do not meet Supplier Diversity program goals."
  },
  {
    "item": "Payment to MBE/WBE",
    "details": "District will pay MBE/WBE contractors every two weeks for labor cost upon presentation of required documentation (upon request and verification of need)."
  },
  {
    "item": "MBE/WBE Certification Requirements",
    "details": "MBE/WBE firms must be certified by City of St. Louis, St. Louis Minority Supplier Development Council, Missouri Regional Certification Committee, State Certifications, National Minority Supplier Development Council, or Women Business Enterprise National Council on or before the proposal opening date."
  },
  {
    "item": "Manufacturer MBE/WBE Certification",
    "details": "In the case of a manufacturer, MBE/WBE certification by any state division of purchasing or the National Minority Supplier Development Council and its affiliates is accepted."
  },
  {
    "item": "Proposal Withdrawal Period",
    "details": "No proposal may be withdrawn for 60 days subsequent to the specified time for receipt of proposals."
  },
  {
    "item": "Supplier Diversity Program Documentation",
    "details": "Forms A and B are located within the Supplier Diversity document."
  },
  {
    "item": "Subcontractor Utilization Form",
    "details": "Complete the Subcontractor Utilization Form if awarded the bid, listing MBE/WBE firms to be subcontracted with, work/trade, firm name, and subcontract amount."
  },
  {
    "item": "Subcontractor Utilization Form: MBE/WBE breakdown",
    "details": "Report the total MBE and WBE subcontract amounts separately."
  },
  {
    "item": "Subcontractor Utilization Form: Total Bid and MBE/WBE percentages",
    "details": "Include the Total Bid amount, as well as the calculated Total MBE % and Total WBE %."
  },
  {
    "item": "MBE/WBE Certification",
    "details": "If applicable, certify MBE/WBE status on Form A. Only the portion of work managed and performed by the certified MBE/WBE will count toward the goal."
  },
  {
    "item": "HSD Form A",
    "details": "Complete HSD Form A."
  },
  {
    "item": "HSD Form B",
    "details": "Complete HSD Form B if applicable"
  },
  {
    "item": "E-Verify Affidavit",
    "details": "Provide an affidavit affirming the use of E-Verify and that the business does not employ illegal workers if the contract may exceed $5,000, as required by Section 285.530, RSMo."
  },
  {
    "item": "OSHA Training Documentation",
    "details": "Provide documentation of a ten (10) hour OSHA construction safety program for on-site workers of public works projects, as required by §292.675, RSMo. If employees have already completed the program, provide documentation of completion."
  },
  {
    "item": "Client References",
    "details": "Supply at least three (3) client references for completed work in the last 1-2 years. Provide organization name, address, phone, contact person, project description, and contract amount for each reference."
  },
  {
    "item": "Business Entity Certification",
    "details": "Certify the current business status by completing either Box A, Box B, or Box C on the Exhibit."
  },
  {
    "item": "Business Entity Definition Compliance",
    "details": "Proposals must comply with the definition of a business entity as defined in section 285.525, RSMo."
  },
  {
    "item": "Box A Certification",
    "details": "If not a business entity, complete Box A, indicating reason (self-employed or utilizing direct sellers)."
  },
  {
    "item": "Alien Status Certification",
    "details": "Certify that the company/individual is not an alien unlawfully present in the United States."
  },
  {
    "item": "Business Status Change Notification",
    "details": "If business status changes to become a business entity during the contract, the change must be reported."
  },
  {
    "item": "Work Authorization Affidavit (Business Entity)",
    "details": "If the consultant/contractor meets the definition of a business entity per section 285.525, RSMo, an Affidavit of Work Authorization must be completed and returned."
  },
  {
    "item": "E-Verify Enrollment and Participation",
    "details": "The business entity must affirm that it is enrolled and will continue to participate in the E-Verify federal work authorization program for employees hired after enrollment who are proposed to work on the contract."
  },
  {
    "item": "Unauthorized Alien Employment Prohibition",
    "details": "The business entity must affirm that it does not and will not knowingly employ an unauthorized alien in connection with the contracted services."
  },
  {
    "item": "Box B Completion Requirement",
    "details": "Business entities not yet complying with federal work authorization program requirements as described at www.e-verify.gov/ must complete Box B."
  },
  {
    "item": "Box B Compliance and Documentation",
    "details": "Business entities completing Box B must comply with the requirements stated in Box B and provide Rockwood School District with all documentation required in Box B."
  },
  {
    "item": "Box A Completion Requirement",
    "details": "Non-business entities must complete Box A."
  },
  {
    "item": "Box C Completion Requirement",
    "details": "Business entities with current work authorization documentation on file with a Missouri state agency, including Division of Purchasing and Materials Management, must complete Box C."
  },
  {
    "item": "False Statements Penalty",
    "details": "Acknowledgement that false statements are subject to penalties under section 575.040, RSMo."
  },
  {
    "item": "Authorized Representative Signature",
    "details": "Signature of the authorized representative."
  },
  {
    "item": "Printed Name",
    "details": "Printed name of the authorized representative."
  },
  {
    "item": "Title",
    "details": "Title of the authorized representative."
  },
  {
    "item": "Date",
    "details": "Date of signature."
  },
  {
    "item": "E-Mail Address",
    "details": "E-mail address of the authorized representative."
  },
  {
    "item": "E-Verify Company ID Number",
    "details": "E-Verify Company ID Number."
  },
  {
    "item": "Notary Acknowledgment",
    "details": "Subscribed and sworn to before a notary public, including date, county, state, and commission expiration date."
  },
  {
    "item": "Business Entity Status (Box B)",
    "details": "If not providing E-Verify documentation or Affidavit of Work Authorization, complete Box B."
  },
  {
    "item": "Business Entity Name",
    "details": "State the Business Entity Name"
  },
  {
    "item": "Representative Name (Print)",
    "details": "Representative Name printed"
  },
  {
    "item": "Representative Signature",
    "details": "Signature of business entity representative"
  },
  {
    "item": "Date",
    "details": "Date of signature."
  },
  {
    "item": "E-Mail Address",
    "details": "Email address of representative"
  },
  {
    "item": "E-Verify Enrollment and Participation",
    "details": "Enroll and participate in the E-Verify program for employees working on the contract."
  },
  {
    "item": "E-Verify Documentation",
    "details": "Provide documentation affirming enrollment and participation in the E-Verify program, including the E-Verify Employment Eligibility Verification page."
  },
  {
    "item": "E-Verify Documentation OR Affidavit of Work Authorization",
    "details": "Submit E-Verify Employment Eligibility Verification page OR page from the E-Verify MOU listing the consultant’s/contractor’s name and MOU signature page signed by consultant/contractor and Department of Homeland Security OR Submit a completed, notarized Affidavit of Work Authorization"
  },
  {
    "item": "Affidavit of Work Authorization - Notarization",
    "details": "The Affidavit of Work Authorization must be notarized."
  },
  {
    "item": "Affidavit on File Certification",
    "details": "If claiming Affidavit on File, certify business entity meets definition in section 285.525, RSMo, pertaining to section 285.530, RSMo, and currently participates in E-Verify"
  },
  {
    "item": "Previous E-Verify Documentation",
    "details": "If claiming Affidavit on File, provide the previously submitted E-Verify Employment Eligibility Verification page OR E-Verify MOU page with signature page."
  },
  {
    "item": "Current Affidavit of Work Authorization",
    "details": "If claiming Affidavit on File, provide the previously submitted current, notarized Affidavit of Work Authorization (must be completed, signed, and notarized within the past twelve months)."
  },
  {
    "item": "Name of Missouri State Agency or Public University",
    "details": "If claiming Affidavit on File, provide the Name of Missouri State Agency or Public University where documents were previously submitted."
  },
  {
    "item": "E-Verify Documentation Submission",
    "details": "Provide details of previous E-Verify documentation submission, including date and RFP/RFQ number."
  },
  {
    "item": "Authorized Business Entity Representative Information",
    "details": "Include the printed name, signature, E-Verify MOU Company ID Number, and email address of the authorized business entity representative."
  },
  {
    "item": "Business Entity Name",
    "details": "Provide the name of the business entity."
  },
  {
    "item": "Date",
    "details": "Indicate the date of submission."
  },
  {
    "item": "Contractor Information",
    "details": "Provide the contractor's address, city, state, zip code, telephone number, and Tax Identification Number (or Social Security Number)."
  },
  {
    "item": "Contract Execution",
    "details": "The successful contractor will be required to enter into a contract with the Owner per the proposal specifications and proposal submission."
  },
  {
    "item": "Contractor Signature",
    "details": "Contractor's signature and date required."
  },
  {
    "item": "Notary Public",
    "details": "Subscribed and sworn to before a Notary Public, including commission expiration date."
  },
  {
    "item": "District Signature",
    "details": "District's signature and date required."
  },
  {
    "item": "HSD FORM A – MBE/WBE Subcontractor Utilization Form",
    "details": "Submit the completed HSD FORM A."
  },
  {
    "item": "HSD FORM B – MBE/WBE Subcontractor Solicitation Form",
    "details": "Submit the completed HSD FORM B."
  },
  {
    "item": "Proposal Response Sheet",
    "details": "Submit the Proposal Response Sheet."
  },
  {
    "item": "E-Verify Affidavits",
    "details": "Submit E-Verify Affidavits."
  },
  {
    "item": "Completed W-9",
    "details": "Submit the completed W-9 form."
  },
  {
    "item": "Agreement for Contracted Services",
    "details": "Submit the Agreement for Contracted Services."
  },
  {
    "item": "RFP Proposal",
    "details": "Submit the RFP Proposal."
  }
]